In [1]:
import pandas as pd

In [2]:
#DataFrame
df=pd.read_csv("employee_details.csv")
df

   employeeid employeename  salary department  branch
0         123       mahesh   60000         hr  mumbai
1         124       manish   35000         hr  mumbai
2         125      marisha   80000      sales  mumbai
3         126      manisha   50000         hr    pune
4         127       manish   40000      sales    pune

In [3]:
df[df.branch=="mumbai"]

   employeeid employeename  salary department  branch
0         123       mahesh   60000         hr  mumbai
1         124       manish   35000         hr  mumbai
2         125      marisha   80000      sales  mumbai

In [4]:
df[df.branch=="pune"]

   employeeid employeename  salary department branch
3         126      manisha   50000         hr   pune
4         127       manish   40000      sales   pune

In [5]:
df.branch

0    mumbai
1    mumbai
2    mumbai
3      pune
4      pune
Name: branch, dtype: object

In [6]:
df["branch"]

0    mumbai
1    mumbai
2    mumbai
3      pune
4      pune
Name: branch, dtype: object

In [7]:
df[["employeeid","employeename"]]

   employeeid employeename
0         123       mahesh
1         124       manish
2         125      marisha
3         126      manisha
4         127       manish

In [8]:
df[df["salary"]>50000]

   employeeid employeename  salary department  branch
0         123       mahesh   60000         hr  mumbai
2         125      marisha   80000      sales  mumbai

In [9]:
df[(df["salary"]>50000) & (df["department"]=="hr")]

   employeeid employeename  salary department  branch
0         123       mahesh   60000         hr  mumbai

In [10]:
df["salary"].sum()

265000

In [11]:
df["salary"].max()

80000

In [12]:
df["salary"].min()

35000

In [13]:
df["salary"].mean()

53000.0

In [14]:
df["salary"].count()

5

In [15]:
df["salary"].std()

17888.54381999832

In [16]:
df["salary"].var()

320000000.0

In [17]:
df["salary"].describe()

count        5.00000
mean     53000.00000
std      17888.54382
min      35000.00000
25%      40000.00000
50%      50000.00000
75%      60000.00000
max      80000.00000
Name: salary, dtype: float64

In [18]:
df.describe()

       employeeid       salary
count    5.000000      5.00000
mean   125.000000  53000.00000
std      1.581139  17888.54382
min    123.000000  35000.00000
25%    124.000000  40000.00000
50%    125.000000  50000.00000
75%    126.000000  60000.00000
max    127.000000  80000.00000

In [19]:
df.describe(include="all")

        employeeid employeename       salary department  branch
count     5.000000            5      5.00000          5       5
unique         NaN            4          NaN          2       2
top            NaN       manish          NaN         hr  mumbai
freq           NaN            2          NaN          3       3
mean    125.000000          NaN  53000.00000        NaN     NaN
std       1.581139          NaN  17888.54382        NaN     NaN
min     123.000000          NaN  35000.00000        NaN     NaN
25%     124.000000          NaN  40000.00000        NaN     NaN
50%     125.000000          NaN  50000.00000        NaN     NaN
75%     126.000000          NaN  60000.00000        NaN     NaN
max     127.000000          NaN  80000.00000        NaN     NaN